Repository: Thomasyse/BDMatch
Catalog: BDMatchUI/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# BDMatchUI/AboutPage/Text_About
source: BDMatch Version {0} This binary distribution is licensed under GPLv3. BDMatch Project: Copyright (c) {3}, Thomasys Dependencies: FFmpeg {1} FFTW {2}: Matteo Frigo and Steven G. Johnson, Proceedings of the IEEE 93 (2), 216–231 (2005).
zh_cn: BDMatch 版本 {0} 该二进制分发从属于 GPLv3 协议 BDMatch 项目: 版权所有(c) {3}, Thomasys 依赖: FFmpeg {1} FFTW {2}: Matteo Frigo and Steven G. Johnson, Proceedings of the IEEE 93 (2), 216–231 (2005).

# BDMatchUI/Common/Text_Cancelled
source: Cancelled
zh_cn: 已取消

# BDMatchUI/Common/Text_CentiSec
source: Centi Sec
zh_cn: 厘秒

# BDMatchUI/Common/Text_DebugMode
source: Debug Mode
zh_cn: 调试模式

# BDMatchUI/Common/Text_Decoding
source: Decoding...
zh_cn: 解码…

# BDMatchUI/Common/Text_Error
source: Error
zh_cn: 错误

# BDMatchUI/Common/Text_Finish
source: Total matching {0} items: {1} Warnings, {2} Errors, {3} {4} taken
zh_cn: 共匹配{0}项：警告{1}个，错误{2}个，用时{3}{4}

# BDMatchUI/Common/Text_Info
source: Info
zh_cn: 信息

# BDMatchUI/Common/Text_ISA_AVX
source: : Accelerated with SSE2, SSSE3, SSE4.1, and AVX instruction sets
zh_cn: ：使用SSE2、SSSE3、SSE4.1、AVX指令集加速

# BDMatchUI/Common/Text_ISA_AVX2
source: : Accelerated with AVX, AVX2, and FMA instruction sets
zh_cn: ：使用AVX、AVX2、FMA指令集加速

# BDMatchUI/Common/Text_ISA_NO_SIMD
source: : No acceleration with enhanced instruction set
zh_cn: ：不使用增强指令集加速

# BDMatchUI/Common/Text_ISA_SSE
source: : Accelerated with SSE2, SSE3, and SSE4.1 instruction sets
zh_cn: ：使用SSE2、SSSE3、SSE4.1指令集加速

# BDMatchUI/Common/Text_Match
source: Match
zh_cn: 匹配

# BDMatchUI/Common/Text_Matching
source: Matching subtitle
zh_cn: 匹配字幕…

# BDMatchUI/Common/Text_Off
source: Off
zh_cn: 关

# BDMatchUI/Common/Text_On
source: On
zh_cn: 开

# BDMatchUI/Common/Text_ProgStat
source: Matching ({0}/{1}): {2}
zh_cn: 正在匹配（{0}/{1}）： {2}

# BDMatchUI/Common/Text_Ready
source: Ready
zh_cn: 就绪

# BDMatchUI/Common/Text_Sec
source: Sec
zh_cn: 秒

# BDMatchUI/Common/Text_Stop
source: Stop
zh_cn: 停止

# BDMatchUI/Common/Text_Stopped
source: Stopped
zh_cn: 已停止

# BDMatchUI/Common/Text_Sub
source: Sub
zh_cn: 字幕

# BDMatchUI/Common/Text_SubTimeDelay
source: Subtitle time offset: Delayed
zh_cn: 字幕时间偏置：延后

# BDMatchUI/Common/Text_Subtitle
source: Subtitle
zh_cn: 字幕

# BDMatchUI/Common/Text_Warning
source: Warning
zh_cn: 警告

# BDMatchUI/DeccodeSettingsPage/FFTNumElbr.Text
source: The number of sample points input for a Fast Fourier Transform. Please set it to a value close to one percent of the sampling rate. If the number of FFT samples is too small, the decoding and matching speed will be slow, and if the number of FFT samples is too large, the matching accuracy will decrease.
zh_cn: 进行一次快速傅里叶变换（Fast Fourier Transform）所输入的采样点个数。请设置为接近采样率百分之一的数值。FFT采样数过小会导致解码和匹配速度缓慢，FFT采样数过大会导致匹配精度下降。

# BDMatchUI/DeccodeSettingsPage/FFTNumText.Text
source: FFT Sampling Size:
zh_cn: FFT采样数：

# BDMatchUI/DeccodeSettingsPage/MinFindDBElbr.Text
source: Noise below the minimum loudness will be filtered to ensure that the decoded spectrum is not interfered by noise.
zh_cn: 最小响度以下的噪声会被过滤，以保证解码生成的声谱不被噪声干扰。

# BDMatchUI/DeccodeSettingsPage/MinFindDBText.Text
source: Min Loudness:
zh_cn: 最小响度：

# BDMatchUI/DeccodeSettingsPage/OutputPCMElbr.Text
source: Ouput audio files as WAV format to check whether the decoding is working properly. There will be noise in resampled audio, but it does not affect matching.
zh_cn: 生成WAV格式音频文件，用以检查解码是否正常工作。重采样生成的音频会有噪声，但不会影响匹配。

# BDMatchUI/DeccodeSettingsPage/OutputPCMText.Text
source: Output Decoded Audio:
zh_cn: 输出解码后的音频：

# BDMatchUI/DeccodeSettingsPage/ParallelDecodeElbr.Text
source: Decode TV and BD files simultaneously. Only enable this option on a device with a high-performance hard disk, otherwise the decoding speed may decrease instead of increasing when the hard disk load is heavy.
zh_cn: 同时进行TV和BD文件的解码。请在拥有高性能硬盘的设备上开启此选项，否则可能会导致在硬盘负载较大时解码速度不升反降。

# BDMatchUI/DeccodeSettingsPage/ParallelDecodeText.Text
source: Parallel Decoding:
zh_cn: 并行解码：

# BDMatchUI/DeccodeSettingsPage/VolMatchElbr.Text
source: Compensate the BD audio loudness to align with the TV. In this case, the BD audio will be decoded twice. It is recommended to turn this option on when the loudness difference between TV and BD audio is too large.
zh_cn: 对BD音频响度进行补偿，使BD音频的响度与TV一致。此时会对BD音频进行两次解码。建议在TV和BD音频响度差距过大时开启此选项。

# BDMatchUI/DeccodeSettingsPage/VolMatchText.Text
source: Loudness Compensation:
zh_cn: 响度补偿：

# BDMatchUI/Error/DecodeError
source: Decoding failed!
zh_cn: 解码失败！

# BDMatchUI/Error/EmptyPath
source: The path is empty!
zh_cn: 文件路径为空！

# BDMatchUI/Error/InvalidRegex
source: Illegal regular expression: {0}
zh_cn: 非法正则表达式： {0}

# BDMatchUI/Error/NotRegexPath
source: Path {0} is not a regular expression path!
zh_cn: 路径 {0} 不是正则表达式路径！

# BDMatchUI/Error/PathNotExist
source: The path does not exist!
zh_cn: 路径不存在！

# BDMatchUI/Error/Prefix
source: Error:
zh_cn: 错误：

# BDMatchUI/Error/User_Stop
source: User terminated.
zh_cn: 用户终止操作。

# BDMatchUI/HelpPage/BatchProcessingHeader.Text
source: Batch Processing
zh_cn: 批量处理

# BDMatchUI/HelpPage/BatchProcessingText.Text
source: Multiple files can be input using line breaks. It can also be done by clicking 「...」 or dragging and placing. In order for the program to run correctly, please ensure that the input files for subtitles, TV, and BD correspond one by one.
zh_cn: 可以使用换行输入多个文件。通过点击「...」或者拖动放置也可以输入多个文件。为了让程序能正确运行，请确保字幕、TV、BD输入的文件是逐个对应的。

# BDMatchUI/HelpPage/ExcludeSubExprHeader.Text
source: Excluding Subexpression
zh_cn: 排除子表达式

# BDMatchUI/HelpPage/ExcludeSubExprText.Text
source: Use 「(?:<Subexpression>)」 to exclude the subexpression from the common part of the regular expression search. Please check out "Non-Capturing Group" in ".NET Regular Expressions" for details.
zh_cn: 使用「(?:<子表达式>)」可以在将该子表达式排除在正则查找的共通部分外。请查阅「.NET正则表达式」中的「非捕获组」以获取详细信息。

# BDMatchUI/HelpPage/FastRegexHeader.Text
source: Creating Regular Expressions Fast
zh_cn: 快速创建正则表达式

# BDMatchUI/HelpPage/FastRegexText.Text
source: Click 「R#」 to convert the <path> in the expression 「"<Path>"」 into the corresponding regular expression. Path regular expressions can be created more quickly this way.
zh_cn: 点击「R#」可以将输入「"<路径>"」中的<路径>转换为对应的正则表达式。可以通过这种方式更快捷地创建路径正则表达式。

# BDMatchUI/HelpPage/OneToMultiHeader.Text
source: One-to-Many Mode
zh_cn: 一对多模式

# BDMatchUI/HelpPage/OneToMultiText.Text
source: When the subtitle and TV input have only one file and the BD input has multiple files, the subtitle and TV file will be used to match each BD file.
zh_cn: 当字幕和TV输入只有一个文件并且BD输入有多个文件时，将会使用字幕和TV文件对每个BD文件进行匹配。

# BDMatchUI/HelpPage/UsingRegexHeader.Text
source: Using Regular Expressions
zh_cn: 使用正则表达式

# BDMatchUI/HelpPage/UsingRegexText.Text
source: Use 「<Path1>\"<Regular Expression>"[\<Path2>]」 to search for files or folders according to regular expressions in <Path1> (recursive search not supported). Regular expressions can be placed at any level in the path except the drive letter. Please use 「(<subexpression>)」 to indicate the common part in subtitle, BD, and TV file paths. After 「Match」clicked, the program will automatically find pairs with the same common parts and display them in respective input box. Please check out 「.NET Regular Expressions」 for more information about regular expressions.
zh_cn: 使用「<路径1>\"<正则表达式>"[\<路径2>]」（请使用半角「"」）可以在<路径1>中按照正则表达式查找文件或文件夹（不支持递归查找）。正则表达式可以用在路径中除了盘符以外的任何一级。请使用「(<子表达式>)」表示字幕、BD、TV路径中的共通部分。点击「匹配」后，程序将会自动查找拥有相同共通部分的配对并显示在各输入框中。请查阅「.NET正则表达式」以获取关于正则表达式的详细信息。

# BDMatchUI/Info/Batch_No_Draw
source: Batch processing will not draw spectrograms
zh_cn: 批量处理将不作声谱图

# BDMatchUI/Info/Prefix
source: Info:
zh_cn: 信息：

# BDMatchUI/MainWindow/Navi/About.Content
source: About
zh_cn: 关于

# BDMatchUI/MainWindow/Navi/Decode_Settings.Content
source: Decoding Settings
zh_cn: 解码设置

# BDMatchUI/MainWindow/Navi/Help.Content
source: Help
zh_cn: 帮助

# BDMatchUI/MainWindow/Navi/Logs.Content
source: Logs
zh_cn: 日志

# BDMatchUI/MainWindow/Navi/Match.Content
source: Matching
zh_cn: 匹配

# BDMatchUI/MainWindow/Navi/Match_and_Result.Content
source: Matching and Results
zh_cn: 匹配与结果

# BDMatchUI/MainWindow/Navi/Match_Settings.Content
source: Matching Settings
zh_cn: 匹配设置

# BDMatchUI/MainWindow/Navi/Others.Content
source: Others
zh_cn: 其他

# BDMatchUI/MainWindow/Navi/Other_Settings.Content
source: Other Settings
zh_cn: 其他设置

# BDMatchUI/MainWindow/Navi/Settings.Content
source: Settings
zh_cn: 设置

# BDMatchUI/MainWindow/Navi/Spectrum.Content
source: Spectrum
zh_cn: 声谱

# BDMatchUI/MainWindow/Navi/Spectrum_Settings.Content
source: Spectrum Settings
zh_cn: 声谱设置

# BDMatchUI/MatchPage/BDPath.PlaceholderText
source: BD File
zh_cn: BD文件

# BDMatchUI/MatchPage/LogButton.Content
source: Show Log
zh_cn: 显示日志

# BDMatchUI/MatchPage/SubPath.PlaceholderText
source: Subtitle File
zh_cn: 字幕文件

# BDMatchUI/MatchPage/TVPath.PlaceholderText
source: TV File
zh_cn: TV文件

# BDMatchUI/MatchSettingsPage/FastMatchElbr.Text
source: When turned on, only a few timelines are matched, and the rest of the timelines are adjusted based on the matching results. Since the BD file may undergo some modifications, the matching results may be inaccurate.
zh_cn: 开启后，只匹配少许时间轴，其余时间轴根据匹配结果进行调整。由于BD文件可能会进行一些修改，匹配结果可能会不准确。

# BDMatchUI/MatchSettingsPage/FastMatchText.Text
source: Fast Matching:
zh_cn: 快速匹配：

# BDMatchUI/MatchSettingsPage/MatchEnElbr.Text
source: When turned off, only audio decoding will be performed and no matching will be performed.
zh_cn: 关闭后只会进行音频解码，不会进行匹配。

# BDMatchUI/MatchSettingsPage/MatchEnText.Text
source: Matching Subtitles:
zh_cn: 对字幕进行匹配：

# BDMatchUI/MatchSettingsPage/MaxLengthElbr.Text
source: Timelines that exceed the maximum matching length will not be processed to prevent excessively long blank lines from affecting the matching speed.
zh_cn: 超过最大匹配轴长的时间轴将不会进行处理，以防止过长的空轴影响匹配速度。

# BDMatchUI/MatchSettingsPage/MaxLengthText.Text
source: Max Matching Length:
zh_cn: 最大匹配轴长：

# BDMatchUI/MatchSettingsPage/MinCnfrmNumElbr.Text
source: Confirm the tentatively selected matching point that is searched for. After confirming enough times, it will be selected as the best point. If the number of confirmations is too small, the matching will be inaccurate, and if the number of confirmations is too large, the matching time will be lengthened.
zh_cn: 对搜索到的暂优匹配选点进行确认，确认足够次数后即会取作最佳选点。过小的确认次数会导致匹配不精确，过大的确认次数会加长匹配时间。

# BDMatchUI/MatchSettingsPage/MinCnfrmNumText.Text
source: Match Confirmation Times:
zh_cn: 匹配确认次数：

# BDMatchUI/MatchSettingsPage/SearchRangeElbr.Text
source: Determine the time range before and after the timeline in subtitle to look for the best match. Increasing the search range will lengthen the matching time, and a search range that is too small will result in the inability to match the correct time.
zh_cn: 决定在字幕时间轴前后多大时间范围内查找最佳匹配。查找范围增加会加长匹配时间，过小的查找范围会导致无法匹配到正确的时间。

# BDMatchUI/MatchSettingsPage/SearchRangeText.Text
source: Search Range: Between Before and After
zh_cn: 查找范围：前后

# BDMatchUI/MatchSettingsPage/SubOffsetElbr.Text
source: Offset the timeline in the subtitle to a certain extent before matching.
zh_cn: 将字幕中的时间轴进行一定的偏移之后再进行匹配。

# BDMatchUI/OtherSettingsPage/LanguageText.Text
source: Language:
zh_cn: 语言：

# BDMatchUI/Regex/FoundNMatch
source: Regular Expression Search: {0} matches found in total
zh_cn: 正则查找：共找到{0}个匹配

# BDMatchUI/Regex/Pair_FoundNMatch
source: Regular Expression Search: {0} matches found in total for this combination
zh_cn: 正则查找：该组合共找到{0}个匹配

# BDMatchUI/Regex/Pattern_FoundNMatch
source: Regular Expression Search: The expression " {0} " found {1} match(es)
zh_cn: 正则查找：表达式“ {0} ”找到{1}个匹配

# BDMatchUI/Regex/Searching
source: Regular expression detected, looking for matching files...
zh_cn: 检测到正则匹配符，正在查找符合的文件…

# BDMatchUI/SpectrumPage/ChannelText.Text
source: Channel:
zh_cn: 声道：

# BDMatchUI/SpectrumPage/Channel_Invalid
source: No such channel!
zh_cn: 无该声道！

# BDMatchUI/SpectrumPage/Channel_Left
source: Left
zh_cn: 左声道

# BDMatchUI/SpectrumPage/Channel_Right
source: Right
zh_cn: 右声道

# BDMatchUI/SpectrumPage/JumpSelText.Text
source: Jump:
zh_cn: 跳转：

# BDMatchUI/SpectrumPage/JumpSel_Time
source: By Time
zh_cn: 按时间

# BDMatchUI/SpectrumPage/JumpSel_Timeline
source: By Timeline
zh_cn: 按时轴

# BDMatchUI/SpectrumPage/Not_Matched
source: Not Matched!
zh_cn: 未匹配！

# BDMatchUI/SpectrumPage/No_Spectrum
source: No spectrum!
zh_cn: 无声谱！

# BDMatchUI/SpectrumPage/ScaleSliderText.Text
source: Scale:
zh_cn: 缩放：

# BDMatchUI/SpectrumSettingsPage/DrawSpecElbr.Text
source: Turn on this option to view the decoded spectrogram and compare the spectrograms of the original subtitle timeline and the matched timeline.
zh_cn: 打开此选项可以查看解码得到的声谱图，并对原字幕时间轴和匹配后的时间轴所对应的声谱进行对比。

# BDMatchUI/SpectrumSettingsPage/DrawSpecText.Text
source: Draw Spectrogram:
zh_cn: 作声谱图：

# BDMatchUI/Warning/Diff_Batch_Cnt
source: Numbers of subtitle, TV, and BD files are inconsistent!
zh_cn: 字幕、TV、BD文件数量不一致！

# BDMatchUI/Warning/Prefix
source: Warning:
zh_cn: 警告：
